# GetReleaseConditions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..GetReleaseConditions Method
AnalyticalMember Class See Also
---
Gets the release conditions associated with this Analytical Member.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<ReleaseConditions> GetReleaseConditions()
```

Visual Basic
---
```text
Public Function GetReleaseConditions As IList(Of ReleaseConditions)
```

Visual C++
---
```text
public:
IList<ReleaseConditions^>^ GetReleaseConditions()
```

# ### Return Value
Returns a collection of Release Conditions associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Release Conditions. End to which release conditions will be added is defined by setting [!:Autodesk::Revit::DB::Structure::ReleaseConditions::Position] property in provided release conditions object.
# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace